src/conf/xml-resources/web-service-references/CatalogueService/wsdl/openweb-stg.nlb.gov.sg/OWS/CatalogueService.svc.wsdl_wsdl0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions targetNamespace="http://www.nlb.gov.sg/ws/CatalogueService" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://www.nlb.gov.sg/ws/CatalogueService" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"><wsdl:types><xsd:schema targetNamespace="http://www.nlb.gov.sg/ws/CatalogueService/Imports"><xsd:import schemaLocation="http://openweb-stg.nlb.gov.sg/OWS/CatalogueService.svc?xsd=xsd0" namespace="http://www.nlb.gov.sg/ws/CatalogueService"/></xsd:schema></wsdl:types><wsdl:message name="SearchRequest1"><wsdl:part name="SearchRequest" element="tns:SearchRequest"/></wsdl:message><wsdl:message name="SearchResponse1"><wsdl:part name="SearchResponse" element="tns:SearchResponse"/></wsdl:message><wsdl:message name="GetTitleDetailsRequest1"><wsdl:part name="GetTitleDetailsRequest" element="tns:GetTitleDetailsRequest"/></wsdl:message><wsdl:message name="GetTitleDetailsResponse1"><wsdl:part name="GetTitleDetailsResponse" element="tns:GetTitleDetailsResponse"/></wsdl:message><wsdl:message name="GetAvailabilityInfoRequest1"><wsdl:part name="GetAvailabilityInfoRequest" element="tns:GetAvailabilityInfoRequest"/></wsdl:message><wsdl:message name="GetAvailabilityInfoResponse1"><wsdl:part name="GetAvailabilityInfoResponse" element="tns:GetAvailabilityInfoResponse"/></wsdl:message><wsdl:portType name="ICatalogueService"><wsdl:operation name="Search"><wsdl:input wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/Search" name="SearchRequest1" message="tns:SearchRequest1"/><wsdl:output wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/SearchResponse" name="SearchResponse1" message="tns:SearchResponse1"/></wsdl:operation><wsdl:operation name="GetTitleDetails"><wsdl:input wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/GetTitleDetails" name="GetTitleDetailsRequest1" message="tns:GetTitleDetailsRequest1"/><wsdl:output wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/GetTitleDetailsResponse" name="GetTitleDetailsResponse1" message="tns:GetTitleDetailsResponse1"/></wsdl:operation><wsdl:operation name="GetAvailabilityInfo"><wsdl:input wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/GetAvailabilityInfo" name="GetAvailabilityInfoRequest1" message="tns:GetAvailabilityInfoRequest1"/><wsdl:output wsaw:Action="http://www.nlb.gov.sg/ws/CatalogueService/ICatalogueService/GetAvailabilityInfoResponse" name="GetAvailabilityInfoResponse1" message="tns:GetAvailabilityInfoResponse1"/></wsdl:operation></wsdl:portType></wsdl:definitions>